In [2]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt

### EDA

### 1. users data 
- no duplicates in user_id
- non-null objects

In [4]:
user_df = pd.read_csv("users.csv")
user_df.head()

   user_id install_date lang country     hw_ver os_ver
0        0   2019-03-01   en      US  iPhone4,1    9.1
1        1   2019-03-01   en      IN    iPod5,1  8.1.2
2        2   2019-03-06   en      US    iPod7,1  8.4.1
3        3   2019-03-03   nb      NO  iPhone8,1  9.2.1
4        4   2019-03-03   en      GB  iPhone5,4  9.2.1

In [28]:
user_df["user_id"].nunique()

22576

In [21]:
user_df.shape[0] == user_df["user_id"].nunique()

True

In [23]:
display(user_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22576 entries, 0 to 22575
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   user_id       22576 non-null  int64
 1   install_date  22576 non-null  object
 2   lang          22576 non-null  object
 3   country       22564 non-null  object
 4   hw_ver        22576 non-null  object
 5   os_ver        22576 non-null  object
dtypes: int64(1), object(5)
memory usage: 1.0+ MB

None

### 2. sessions data

In [5]:
sessions_df = pd.read_csv("sessions.csv")
sessions_df.head()

,user_id,ts,date,session_num,last_session_termination_type
0,14067,2019-03-01 00:06:50,2019-03-01,1,NaN
1,14067,2019-03-01 00:22:27,2019-03-01,2,NaN
2,16275,2019-03-01 01:23:03,2019-03-01,1,NaN
3,16275,2019-03-01 01:31:16,2019-03-01,2,NaN
4,16275,2019-03-01 01:47:22,2019-03-01,3,NaN

In [25]:
sessions_df.drop_duplicates().shape

(722831, 5)

In [26]:
sessions_df.shape

(722955, 5)

### 3. iaps data

In [6]:
iaps_df = pd.read_csv("iaps.csv") ## this is for game adminitratiion's side
iaps_df.head()

,user_id,ts,date,prod_name,prod_type,rev
0,7480,2019-03-04 08:15:49,2019-03-04,iap_1_gems_2,gems,760
1,7480,2019-03-04 08:24:15,2019-03-04,iap_1_passes_2,chapterPasses,760
2,7480,2019-03-04 22:49:08,2019-03-04,iap_1_gems_1,gems,410
3,2466,2019-03-06 00:16:48,2019-03-06,iap_1_gems_2,gems,760
4,22001,2019-03-06 09:13:45,2019-03-06,iap_1_gems_2,gems,760

In [29]:
iaps_df.shape

(6685, 6)

In [27]:
iaps_df.user_id.nunique()

1526

In [11]:
iaps_df[iaps_df.user_id == 2062].sort_values(by="ts")

,user_id,ts,date,prod_name,prod_type,rev
3795,2062,2019-03-03 03:50:45,2019-03-03,iap_1_gems_2,gems,760
3796,2062,2019-03-03 03:50:58,2019-03-03,iap_1_gems_2,gems,760
3797,2062,2019-03-03 04:01:32,2019-03-03,iap_1_passes_2,chapterPasses,760
3798,2062,2019-03-03 04:07:34,2019-03-03,iap_1_gems_2,gems,760
3799,2062,2019-03-03 10:40:27,2019-03-03,iap_1_passes_2,chapterPasses,760

### 4. spendevents data

In [7]:
spending_df = pd.read_csv("spendevents.csv")
spending_df.head()

,user_id,ts,date,story,chapter,spendtype,currency,amount
0,9829,2019-03-01 03:03:04,2019-03-01,story_1,0,earnGemsCounter,gems,-22
1,13757,2019-03-01 03:35:53,2019-03-01,story_1,0,earnGemsCounter,gems,-22
2,13757,2019-03-01 03:52:10,2019-03-01,story_2,0,earnGemsCounter,gems,-22
3,10009,2019-03-01 04:10:00,2019-03-01,story_1,0,earnGemsCounter,gems,-22
4,10009,2019-03-01 04:26:46,2019-03-01,story_2,0,earnGemsCounter,gems,-22

In [10]:
spending_df[spending_df.user_id == 2062].sort_values(by="ts") ### this is for game adminitratiion's side

,user_id,ts,date,story,chapter,spendtype,currency,amount
15694,2062,2019-03-02 20:01:22,2019-03-03,story_1,0,earnGemsCounter,gems,-22
15721,2062,2019-03-03 03:50:45,2019-03-03,story_1,5,IAP,gems,-73
15722,2062,2019-03-03 03:50:58,2019-03-03,story_1,5,IAP,gems,-73
15723,2062,2019-03-03 03:51:00,2019-03-03,story_1,5,premiumChoice,gems,64
15724,2062,2019-03-03 04:07:34,2019-03-03,story_1,6,IAP,gems,-73
15725,2062,2019-03-03 04:07:37,2019-03-03,story_1,6,premiumChoice,gems,55
15726,2062,2019-03-03 04:24:58,2019-03-03,story_1,8,premiumChoice,gems,27

# Graphical EDA and insights

### 1. Find the golden time 
- how long does it take for a new user to make the firsr in-app purchase

In [ ]:
users_iaps =

In [ ]:

### 2. Find the main difference features/distribution ft that seperates two groups well 
### 3. Cluster according that features
### 4.

In [ ]:
# Model 
- Paying users are class 1 
- Non-paying users are class 0